benchmark/results/20250922-182939/weekend_waves/load.log

[2025-09-22T18:36:40+03:00] phase=wave1_idle duration=20s qps=18 concurrency=6

Summary:
  Total:	20.7783 secs
  Slowest:	2.3969 secs
  Fastest:	0.7020 secs
  Average:	1.3990 secs
  Requests/sec:	4.2352
  
  Total data:	264 bytes
  Size/request:	3 bytes

Response time histogram:
  0.702 [1]	|■■■
  0.871 [5]	|■■■■■■■■■■■■■
  1.041 [16]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.210 [16]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.380 [6]	|■■■■■■■■■■■■■■■
  1.549 [13]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.719 [9]	|■■■■■■■■■■■■■■■■■■■■■■■
  1.888 [10]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  2.058 [4]	|■■■■■■■■■■
  2.227 [5]	|■■■■■■■■■■■■■
  2.397 [3]	|■■■■■■■■


Latency distribution:
  10% in 0.9015 secs
  25% in 1.0688 secs
  50% in 1.3953 secs
  75% in 1.7704 secs
  90% in 2.0955 secs
  95% in 2.1972 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.7020 secs, 2.3969 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	1.3988 secs, 0.7019 secs, 2.3967 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [200]	88 responses



[2025-09-22T18:37:01+03:00] phase=wave1_peak duration=20s qps=120 concurrency=24

Summary:
  Total:	23.2866 secs
  Slowest:	17.2616 secs
  Fastest:	0.7325 secs
  Average:	5.5235 secs
  Requests/sec:	4.0796
  
  Total data:	285 bytes
  Size/request:	3 bytes

Response time histogram:
  0.733 [1]	|■■
  2.385 [17]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  4.038 [24]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  5.691 [25]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  7.344 [6]	|■■■■■■■■■■
  8.997 [6]	|■■■■■■■■■■
  10.650 [3]	|■■■■■
  12.303 [4]	|■■■■■■
  13.956 [6]	|■■■■■■■■■■
  15.609 [0]	|
  17.262 [3]	|■■■■■


Latency distribution:
  10% in 1.8043 secs
  25% in 3.0665 secs
  50% in 4.3051 secs
  75% in 7.0720 secs
  90% in 12.5681 secs
  95% in 13.1910 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0003 secs, 0.7325 secs, 17.2616 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	5.5231 secs, 0.7324 secs, 17.2603 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	95 responses



[2025-09-22T18:37:24+03:00] phase=wave2_idle duration=20s qps=18 concurrency=6

Summary:
  Total:	20.7703 secs
  Slowest:	2.5037 secs
  Fastest:	0.8966 secs
  Average:	1.5862 secs
  Requests/sec:	3.7554
  
  Total data:	234 bytes
  Size/request:	3 bytes

Response time histogram:
  0.897 [1]	|■■■
  1.057 [9]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.218 [12]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.379 [8]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.539 [12]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.700 [8]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.861 [2]	|■■■■■■■
  2.022 [9]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.182 [6]	|■■■■■■■■■■■■■■■■■■■■
  2.343 [6]	|■■■■■■■■■■■■■■■■■■■■
  2.504 [5]	|■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 1.0023 secs
  25% in 1.2017 secs
  50% in 1.5028 secs
  75% in 2.0053 secs
  90% in 2.2968 secs
  95% in 2.4073 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.8966 secs, 2.5037 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	1.5861 secs, 0.8966 secs, 2.5035 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	78 responses



[2025-09-22T18:37:45+03:00] phase=wave2_peak duration=20s qps=120 concurrency=24

Summary:
  Total:	22.6567 secs
  Slowest:	14.1464 secs
  Fastest:	0.9488 secs
  Average:	5.8367 secs
  Requests/sec:	3.9282
  
  Total data:	267 bytes
  Size/request:	3 bytes

Response time histogram:
  0.949 [1]	|■■
  2.269 [4]	|■■■■■■■
  3.588 [23]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  4.908 [19]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  6.228 [6]	|■■■■■■■■■■
  7.548 [5]	|■■■■■■■■■
  8.867 [14]	|■■■■■■■■■■■■■■■■■■■■■■■■
  10.187 [10]	|■■■■■■■■■■■■■■■■■
  11.507 [5]	|■■■■■■■■■
  12.827 [1]	|■■
  14.146 [1]	|■■


Latency distribution:
  10% in 2.8999 secs
  25% in 3.2052 secs
  50% in 4.6979 secs
  75% in 8.3065 secs
  90% in 10.0976 secs
  95% in 10.3525 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0003 secs, 0.9488 secs, 14.1464 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	5.8362 secs, 0.9471 secs, 14.1448 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	89 responses



[2025-09-22T18:38:08+03:00] phase=wave3_idle duration=20s qps=18 concurrency=6

Summary:
  Total:	20.6455 secs
  Slowest:	3.3131 secs
  Fastest:	0.8192 secs
  Average:	1.5995 secs
  Requests/sec:	3.6812
  
  Total data:	228 bytes
  Size/request:	3 bytes

Response time histogram:
  0.819 [1]	|■■
  1.069 [17]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.318 [17]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.567 [6]	|■■■■■■■■■■■■■■
  1.817 [9]	|■■■■■■■■■■■■■■■■■■■■■
  2.066 [9]	|■■■■■■■■■■■■■■■■■■■■■
  2.316 [6]	|■■■■■■■■■■■■■■
  2.565 [4]	|■■■■■■■■■
  2.814 [4]	|■■■■■■■■■
  3.064 [1]	|■■
  3.313 [2]	|■■■■■


Latency distribution:
  10% in 0.9218 secs
  25% in 1.0811 secs
  50% in 1.3983 secs
  75% in 2.0202 secs
  90% in 2.6183 secs
  95% in 2.9760 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.8192 secs, 3.3131 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	1.5993 secs, 0.8191 secs, 3.3118 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	76 responses



[2025-09-22T18:38:29+03:00] phase=wave3_peak duration=20s qps=120 concurrency=24

Summary:
  Total:	23.3063 secs
  Slowest:	14.2940 secs
  Fastest:	0.6932 secs
  Average:	6.1339 secs
  Requests/sec:	3.6900
  
  Total data:	258 bytes
  Size/request:	3 bytes

Response time histogram:
  0.693 [1]	|■■
  2.053 [4]	|■■■■■■■■
  3.413 [9]	|■■■■■■■■■■■■■■■■■■■
  4.773 [19]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  6.134 [15]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  7.494 [13]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■
  8.854 [8]	|■■■■■■■■■■■■■■■■■
  10.214 [12]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  11.574 [1]	|■■
  12.934 [2]	|■■■■
  14.294 [2]	|■■■■


Latency distribution:
  10% in 3.0953 secs
  25% in 4.2038 secs
  50% in 5.7998 secs
  75% in 8.5944 secs
  90% in 10.0998 secs
  95% in 12.2885 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0003 secs, 0.6932 secs, 14.2940 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	6.1334 secs, 0.6922 secs, 14.2928 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	86 responses